package tasks51.task516;

/* В методе main (точка входа в программу) объяви строковую переменную String name и присвой ей твоё имя при инициализации, после чего выведи её в консоль.

Требования:
1. Переменная должна находиться в методе main
2. Переменная должна иметь тип String
3. Переменная должна иметь имя name
4. В консоль должно быть выведено значение переменной name */

public class Main {

    public static void main(String[] args) {
        String name = "Владимир";
        System.out.println(name);
    }
}
